<!-- terraform cdk action for options with hash 2e679e3a099220b46f78aa91824ccd10 -->
### ❌ Error applying Terraform CDK Stack 'cloudwatch_alarm'



<details><summary>Error: The process '/opt/hostedtoolcache/node/22.7.0/x64/bin/npx' failed with exit code 1</summary>

```shell
(node:2378) [DEP0040] DeprecationWarning: The `punycode` module is deprecated. Please use a userland alternative instead.
(Use `node --trace-deprecation ...` to show where the warning was created)
cloudwatch_alarm  Initializing the backend...
cloudwatch_alarm  Initializing modules...
cloudwatch_alarm  Initializing provider plugins...
                  - Reusing previous version of hashicorp/aws from the dependency lock file
cloudwatch_alarm  - Using previously-installed hashicorp/aws v5.64.0

                  Terraform has been successfully initialized!

                  You may now begin working with Terraform. Try running "terraform plan" to see
                  any changes that are required for your infrastructure. All Terraform commands
                  should now work.

                  If you ever set or change modules or backend configuration for Terraform,
                  rerun this command to reinitialize your working directory. If you forget, other
                  commands will detect it and remind you to do so if necessary.
cloudwatch_alarm  Terraform used the selected providers to generate the following execution plan.
                  Resource actions are indicated with the following symbols:
                    + create

                  Terraform will perform the following actions:
cloudwatch_alarm  # aws_cloudformation_stack.chatbot (chatbot) will be created
                    + resource "aws_cloudformation_stack" "chatbot" {
                        + id            = (known after apply)
                        + name          = "cloudformation-chatbot"
                        + outputs       = (known after apply)
                        + parameters    = (known after apply)
                        + policy_body   = (known after apply)
                        + tags_all      = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + template_body = (known after apply)
                      }

                    # aws_iam_role.alert-to-slack (alert-to-slack) will be created
                    + resource "aws_iam_role" "alert-to-slack" {
                        + arn                   = (known after apply)
                        + assume_role_policy    = jsonencode(
                              {
                                + Statement = [
                                    + {
                                        + Action    = "sts:AssumeRole"
                                        + Effect    = "Allow"
                                        + Principal = {
                                            + Service = "chatbot.amazonaws.com"
                                          }
                                      },
                                  ]
                                + Version   = "2012-10-17"
                              }
                          )
                        + create_date           = (known after apply)
                        + force_detach_policies = false
                        + id                    = (known after apply)
                        + managed_policy_arns   = (known after apply)
                        + max_session_duration  = 3600
                        + name                  = "alert-to-slack"
                        + name_prefix           = (known after apply)
                        + path                  = "/"
                        + tags_all              = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + unique_id             = (known after apply)

                        + inline_policy (known after apply)
                      }

                    # aws_sns_topic.ToSlack (ToSlack) will be created
                    + resource "aws_sns_topic" "ToSlack" {
                        + arn                         = (known after apply)
                        + beginning_archive_time      = (known after apply)
                        + content_based_deduplication = false
                        + fifo_topic                  = false
                        + id                          = (known after apply)
                        + name                        = "AlertToSlack"
                        + name_prefix                 = (known after apply)
                        + owner                       = (known after apply)
                        + policy                      = (known after apply)
                        + signature_version           = (known after apply)
                        + tags_all                    = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + tracing_config              = (known after apply)
                      }

                    # module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0] will be created
                    + resource "aws_cloudwatch_metric_alarm" "this" {
                        + actions_enabled                       = true
                        + alarm_actions                         = (known after apply)
                        + alarm_description                     = "This metric monitors Maximum CPUUtilization"
                        + alarm_name                            = "ec2_Maximum_alarm_CPUUtilization"
                        + arn                                   = (known after apply)
                        + comparison_operator                   = "GreaterThanThreshold"
                        + dimensions                            = {
                            + "InstanceId" = "i-XXXXXXXXXX"
                          }
                        + evaluate_low_sample_count_percentiles = (known after apply)
                        + evaluation_periods                    = 6
                        + id                                    = (known after apply)
                        + metric_name                           = "CPUUtilization"
                        + namespace                             = "AWS/EC2"
                        + period                                = 300
                        + statistic                             = "Maximum"
                        + tags_all                              = {
                            + "IaC"         = "cdktf"
                            + "environment" = "cloudwatch_alarm"
                          }
                        + threshold                             = 90
                        + treat_missing_data                    = "missing"
                      }

                  Plan: 4 to add, 0 to change, 0 to destroy.
cloudwatch_alarm  aws_iam_role.alert-to-slack (alert-to-slack): Creating...
cloudwatch_alarm  aws_sns_topic.ToSlack (ToSlack): Creating...
cloudwatch_alarm  aws_sns_topic.ToSlack (ToSlack): Creation complete after 2s [id=arn:aws:sns:ap-northeast-1:931240111674:AlertToSlack]
cloudwatch_alarm  module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Creating...
cloudwatch_alarm  module.ec2_Maximum_alarm_CPUUtilization.aws_cloudwatch_metric_alarm.this[0]: Creation complete after 1s [id=ec2_Maximum_alarm_CPUUtilization]
cloudwatch_alarm  Error: creating IAM Role (alert-to-slack): operation error IAM: CreateRole, https response error StatusCode: 403, RequestID: dc7bf2ab-2fd2-48c1-bba7-c751a937189c, api error AccessDenied: User: arn:aws:sts::931240111674:assumed-role/cdktf-cwalarm-IAM-ROLE/GitHubActions is not authorized to perform: iam:CreateRole on resource: arn:aws:iam::931240111674:role/alert-to-slack because no identity-based policy allows the iam:CreateRole action

                    with aws_iam_role.alert-to-slack (alert-to-slack),
                    on cdk.tf.json line 79, in resource.aws_iam_role.alert-to-slack (alert-to-slack):
                    79:       }


0 Stacks deploying     1 Stack done     0 Stacks waiting
Invoking Terraform CLI failed with exit code 1

```

</details>